[
  {
    "name": "Sami Lieberman",
    "description": "I am a New York City based software developer.",
    "education": [
      {
        "college": "University of Florida, Herbert Wertheim College of Engineering",
        "location": "Gainesville, Florida",
        "degree": "B.S.E Computer Science Engineering with a Minor in Sales Engineering",
        "graduationYear": "Class of 2019"
      },
      {
        "college": "University of New South Wales",
        "location": "Sydney, Australia",
        "degree": "Study Abroad, Computer Science Engineering",
        "graduationYear": "2018"
      }
    ],
    "employment": [
      {
        "employer": "American Express",
        "title": "Engineer II",
        "jobDescription":[
          "Recently promoted within a 10 month timeline for exceeding goals and outperforming in my previous role.",
          "Deployed applications to production environments by utilizing the CI/CD pipeline.",
          "Worked as a key developer on high profile projects by participating in the end to end integration, which includes discovery, solutioning, grooming, development, testing, coordination with downstream teams, and releasing to production.",
          "Become proficient in QA responsibilities such as automation testing, regression testing, batch testing, unit testing, and virtualization and mocking tools to become well versed in the SDET model of development and testing.",
          "Quickly solutioned, implemented, and deployed fixes to resolve bugs in production.",
          "Led my team as interim Scrum Master through various tasks such as leading scrum ceremonies, collaborating with the Product Owner and Tech Lead, maintaining the team's Rally board, and working with the Release Train Engineer on ensuring we meet the project milestones.",
          "Mentored and onboarded new hires and interns through coffee chats, leading tech trainings, and career development conversations.",
          "Contributed to an open source project used by American Express and as a result, I was added to the Social Contribution Leaderboard.",
          "Participated in Hackathons and innovation events.",
          "Served as a panelist for promotions and led interviews for prospective candidates."
        ],
        "jobLocation": "New York, New York",
        "jobTime": "November 2020 - Present",
        "link": "http://www.americanexpress.com"
      },
      {
        "employer": "American Express",
        "title": "Engineer III",
        "jobDescription":[
          "Worked on features and bug fixes for International card applications in SpringBoot, Java, React, JS, and NodeJS.",
          "Improved teams’ overall code quality by identifying areas of redundant code and suggesting cleaner, reusable alternatives.",
          "Developed an extensive testing suite for my work, including various unit tests and automation scripts to ensure high code coverage and reliability using Selenium, Cucumber, ChromeDriver, and Jest.",
          "Led project’s end-to-end by participating in solutioning, coordinating with dependent teams, developing the changes, and working with dependent teams on testing.",
          "Acted as a key contributor to Agile ceremonies, team planning, and architectural solutioning meetings.",
          "Mentored and onboarded new hires by leading tech bootcamps and hosting weekly one on ones."
        ],
        "jobLocation": "New York, New York",
        "jobTime": "January 2020 - November",
        "link": "http://www.americanexpress.com"
      }
    ]
  }
]
